blog.org
#+HUGO_SECTION: blog
#+HUGO_BASE_DIR: .
#+hugo_auto_set_lastmod: t

** 2018 in Review
:PROPERTIES:
:EXPORT_FILE_NAME: 2018_in_review
:END:

At the end of the year, I normally conduct a retrospective. This is,
however, the first time I'm making it public. Naturally, there are
things that I cannot, or am unwilling to share, and hence this
represents a subset of my reflection over 2018. Here I share the key
milestones and some thoughts in chronological order.

January marked the start of my second semester as a Year 2 Computer
Science student in the National University of Singapore. Some time
late last year, I took an interest in Machine Learning, working on
Carousell's image search and price suggestion mechanism. I took many
ML-related modules, and undertook an undergraduate research project
(more on this later). I took a total of 8 modules, spreading myself
way too thin. I struggled quite a bit that semester, but managed to
pull through because the modules I were taking were interesting and
interconnected.

After the semester I took a nice break in eastern Europe, visiting
Croatia, Bosnia and Slovenia. Upon my return, I joined Carousell as a
Data Scientist Intern, where I internationalized the smart chat
replies feature to non-English speaking countries like Hong Kong. I
also worked on the pipeline that powers the new image search and price
suggestion mechanism. I'm grateful to have been given the opportunity
to work on high-impact features, using large datasets consisting of
millions of products to train models. Carousell has a great data
pipeline that abstracts away a lot of the painful data pre-processing
work for me, allowing me to focus on my experiments and getting things
to work. On hindsight, I should've been more proactive in seeking
advice or looking for colleagues to bounce ideas with: that would've
saved me a significant amount of time.

Before school resumed, I took a short trip to Hangzhou for a Data
Visualization Summer School, with a couple of friends. The summer
school was poorly planned and had a lot of repeated content. However,
we visited a NLP engineer at the Alibaba HQ, and had lots of good
food during our stay.

After a tiring first semester, I decided to take fewer modules. These
modules were 4k modules, and proved to be quite challenging. During
this time, I also continued working part-time for Carousell. This was
also the season for internship applications overseas. At the same
time, I had to put in extra work on the undergraduate research project
I had undertaken at the start of the year, because I chose an
open-ended project and went down a research direction where I couldn't
make substantial contributions. Once again, I was spread way too thin,
and had too many commitments. Things didn't go as smoothly in this
semester.

I applied to a dozen companies, and the interviews lasted from October
into late November. I was not sufficiently prepared for the
interviews, and had erratic performance for each interview. This
proved detrimental, because the application process for all companies
span multiple interviews, and a poor performance in one meant
immediate disqualification. Jane Street invited me to Hong Kong for an
onsite, and I lacked the confidence and preparation to produce clean
and correct answers. What I needed to do better was consistent and
intense practice, including both problems on Leetcode and mock
interviews. On hindsight, an overseas internship was not particularly
high on my priority list, and not getting one is fine with me.

*** Things that went well
In 2018, I adopted, or was more consistent with a number of practices
that I have found to be quite helpful.

First on the list is exercise and meditation. Despite my busy
schedules, a morning run always helped start my day right.

Coming in closely in second place would be reading. I've read 43 books
this year, up from 10 last year. The books I read ranged from
textbooks, to both fiction and non-fiction. I read one fiction book
and one non-fiction book at a time. I read at night, and this helps me
end the day away from the computers.

*** Things that went badly
This year I've been extremely sloppy with deadlines and time
management. I started one of my group projects the week it was due, a
project for which we were given more than 6 weeks. The situation has
slightly improved after I became more rigorous in my Getting Things
Done workflow, and I would need to revisit and simplify this workflow.

I've also spent many days in procrastination. A large part of me is
convinced that this is burnout. I've also definitely not slept enough
this year, and now know acutely the effects of lack of sleep. I've
fallen sick more times than I have in the past half a decade. To
resolve both these problems, I need to settle into a good day and
night routine, and the December holidays is perfect for that.

*** Favourites
Here are some of my favourites of 2018.

**** Books Read
[[http://www.inference.org.uk/itprnn/book.html][David MacKay: Information Theory, Pattern Recognition and Neural
Networks]] was introduced to me as the companion textbook for my
Information Theory module for the first semester of the year, and this
quickly became my favourite textbook of all time. Mackay has the
ability to present information about difficult concepts (I'm looking
at you, Monte Carlo sampling) in an entertaining and digestable
manner. This book also draws the link between statistical inference,
neural networks and information theory, all three interesting topics
stand-alone, but delightful together.

As for fiction, [[https://www.goodreads.com/book/show/20518872-the-three-body-problem][The Three-Body Problem]] is both thought-provoking for
its clever use of scientific ideas, as well as being a depiction of
the Chinese culture during the revolution. I also found myself hooked
to the [[https://www.goodreads.com/book/show/15839976-red-rising?ac=1&from_search=true][Red Rising]] tetralogy.

